output/posts/android_lockscreen_crack/index.org
#+BEGIN_COMMENT
.. title: 安卓锁屏破解
.. slug: android_lockscreen_crack
.. date: 2018-01-29 18:18:40 UTC+08:00
.. tags: 
.. category: 
.. link: 
.. description: 
.. type: text
#+END_COMMENT

** 手势
*** 步骤
1. 获取锁屏界面确定按钮id ~footerRightButton~
2. 找到类 ~ChooseLockPattern~ 中的点击处理函数 ~saveChoosePatternAndFinish~
将Pattern转换为string的函数
#+BEGIN_SRC java
public static String patternToString(List<LockPatternView.Cell> pattern) {
    if (pattern == null) {
        return "";
    }
    final int patternSize = pattern.size();

    byte[] res = new byte[patternSize];
    for (int i = 0; i < patternSize; i++) {
        LockPatternView.Cell cell = pattern.get(i);
        res[i] = (byte) (cell.getRow() * 3 + cell.getColumn());
    }
    return new String(res);
}
#+END_SRC

3. 经过一些列的中间函数，调用 ~LockSettingService~ 的 ~writeFile(getLockPatternFilename(userId), hash);~ 这里hash为先将string转换回pattern。然后用pattern算出一个hash值
#+BEGIN_SRC java
public static byte[] patternToHash(List<LockPatternView.Cell> pattern) {
    if (pattern == null) {
        return null;
    }

    final int patternSize = pattern.size();
    byte[] res = new byte[patternSize];
    for (int i = 0; i < patternSize; i++) {
        LockPatternView.Cell cell = pattern.get(i);
        res[i] = (byte) (cell.getRow() * 3 + cell.getColumn());
    }
    try {
        MessageDigest md = MessageDigest.getInstance("SHA-1");
        byte[] hash = md.digest(res);
        return hash;
    } catch (NoSuchAlgorithmException nsa) {
        return res;
    }
}
#+END_SRC

4. fileName为 ~/data/system/gesture.key~
   
