output/posts/android_lockscreen_crack/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>安卓锁屏破解 | My Nikola Site</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://example.com/posts/android_lockscreen_crack/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Nikola Tesla">
<link rel="prev" href="../just_doing/" title="Just Do" type="text/html">
<link rel="next" href="../libs/" title="libs" type="text/html">
<meta property="og:site_name" content="My Nikola Site">
<meta property="og:title" content="安卓锁屏破解">
<meta property="og:url" content="https://example.com/posts/android_lockscreen_crack/">
<meta property="og:description" content="手势



步骤


获取锁屏界面确定按钮id footerRightButton
找到类 ChooseLockPattern 中的点击处理函数 saveChoosePatternAndFinish


将Pattern转换为string的函数

public static String patternToString(List&lt;LockPatternView.Cell&gt; pattern) {
 ">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2018-01-29T18:18:40+08:00">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-inverse navbar-static-top"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="https://example.com/">

                <span id="blog-title">My Nikola Site</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse" id="bs-navbar" aria-expanded="false">
            <ul class="nav navbar-nav">
<li>
<a href="../../archive.html">Archive</a>
                </li>
<li>
<a href="../../categories/">Tags</a>
                </li>
<li>
<a href="../../rss.xml">RSS feed</a>

                
            </li>
</ul>
<ul class="nav navbar-nav navbar-right">
<li>
    <a href="index.org" id="sourcelink">Source</a>
    </li>

                
            </ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">安卓锁屏破解</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn" itemprop="author">
                    <a href="../../authors/nikola-tesla/">Nikola Tesla</a>
            </span></p>
            <p class="dateline"><a href="." rel="bookmark"><time class="published dt-published" datetime="2018-01-29T18:18:40+08:00" itemprop="datePublished" title="2018-01-29 18:18">2018-01-29 18:18</time></a></p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-org43807f1" class="outline-2">
<h2 id="org43807f1">手势</h2>
<div class="outline-text-2" id="text-org43807f1">
</div>
<div id="outline-container-org71916a1" class="outline-3">
<h3 id="org71916a1">步骤</h3>
<div class="outline-text-3" id="text-org71916a1">
<ol class="org-ol">
<li>获取锁屏界面确定按钮id <code>footerRightButton</code>
</li>
<li>找到类 <code>ChooseLockPattern</code> 中的点击处理函数 <code>saveChoosePatternAndFinish</code>
</li>
</ol>
<p>
将Pattern转换为string的函数
</p>
<div class="highlight"><pre><span></span><span class="kd">public</span> <span class="kd">static</span> <span class="n">String</span> <span class="nf">patternToString</span><span class="o">(</span><span class="n">List</span><span class="o">&lt;</span><span class="n">LockPatternView</span><span class="o">.</span><span class="na">Cell</span><span class="o">&gt;</span> <span class="n">pattern</span><span class="o">)</span> <span class="o">{</span>
    <span class="k">if</span> <span class="o">(</span><span class="n">pattern</span> <span class="o">==</span> <span class="kc">null</span><span class="o">)</span> <span class="o">{</span>
	<span class="k">return</span> <span class="s">""</span><span class="o">;</span>
    <span class="o">}</span>
    <span class="kd">final</span> <span class="kt">int</span> <span class="n">patternSize</span> <span class="o">=</span> <span class="n">pattern</span><span class="o">.</span><span class="na">size</span><span class="o">();</span>

    <span class="kt">byte</span><span class="o">[]</span> <span class="n">res</span> <span class="o">=</span> <span class="k">new</span> <span class="kt">byte</span><span class="o">[</span><span class="n">patternSize</span><span class="o">];</span>
    <span class="k">for</span> <span class="o">(</span><span class="kt">int</span> <span class="n">i</span> <span class="o">=</span> <span class="mi">0</span><span class="o">;</span> <span class="n">i</span> <span class="o">&lt;</span> <span class="n">patternSize</span><span class="o">;</span> <span class="n">i</span><span class="o">++)</span> <span class="o">{</span>
	<span class="n">LockPatternView</span><span class="o">.</span><span class="na">Cell</span> <span class="n">cell</span> <span class="o">=</span> <span class="n">pattern</span><span class="o">.</span><span class="na">get</span><span class="o">(</span><span class="n">i</span><span class="o">);</span>
	<span class="n">res</span><span class="o">[</span><span class="n">i</span><span class="o">]</span> <span class="o">=</span> <span class="o">(</span><span class="kt">byte</span><span class="o">)</span> <span class="o">(</span><span class="n">cell</span><span class="o">.</span><span class="na">getRow</span><span class="o">()</span> <span class="o">*</span> <span class="mi">3</span> <span class="o">+</span> <span class="n">cell</span><span class="o">.</span><span class="na">getColumn</span><span class="o">());</span>
    <span class="o">}</span>
    <span class="k">return</span> <span class="k">new</span> <span class="n">String</span><span class="o">(</span><span class="n">res</span><span class="o">);</span>
<span class="o">}</span>
</pre></div>

<ol class="org-ol">
<li>经过一些列的中间函数，调用 <code>LockSettingService</code> 的 <code>writeFile(getLockPatternFilename(userId), hash);</code> 这里hash为先将string转换回pattern。然后用pattern算出一个hash值</li>
</ol>
<div class="highlight"><pre><span></span><span class="kd">public</span> <span class="kd">static</span> <span class="kt">byte</span><span class="o">[]</span> <span class="nf">patternToHash</span><span class="o">(</span><span class="n">List</span><span class="o">&lt;</span><span class="n">LockPatternView</span><span class="o">.</span><span class="na">Cell</span><span class="o">&gt;</span> <span class="n">pattern</span><span class="o">)</span> <span class="o">{</span>
    <span class="k">if</span> <span class="o">(</span><span class="n">pattern</span> <span class="o">==</span> <span class="kc">null</span><span class="o">)</span> <span class="o">{</span>
	<span class="k">return</span> <span class="kc">null</span><span class="o">;</span>
    <span class="o">}</span>

    <span class="kd">final</span> <span class="kt">int</span> <span class="n">patternSize</span> <span class="o">=</span> <span class="n">pattern</span><span class="o">.</span><span class="na">size</span><span class="o">();</span>
    <span class="kt">byte</span><span class="o">[]</span> <span class="n">res</span> <span class="o">=</span> <span class="k">new</span> <span class="kt">byte</span><span class="o">[</span><span class="n">patternSize</span><span class="o">];</span>
    <span class="k">for</span> <span class="o">(</span><span class="kt">int</span> <span class="n">i</span> <span class="o">=</span> <span class="mi">0</span><span class="o">;</span> <span class="n">i</span> <span class="o">&lt;</span> <span class="n">patternSize</span><span class="o">;</span> <span class="n">i</span><span class="o">++)</span> <span class="o">{</span>
	<span class="n">LockPatternView</span><span class="o">.</span><span class="na">Cell</span> <span class="n">cell</span> <span class="o">=</span> <span class="n">pattern</span><span class="o">.</span><span class="na">get</span><span class="o">(</span><span class="n">i</span><span class="o">);</span>
	<span class="n">res</span><span class="o">[</span><span class="n">i</span><span class="o">]</span> <span class="o">=</span> <span class="o">(</span><span class="kt">byte</span><span class="o">)</span> <span class="o">(</span><span class="n">cell</span><span class="o">.</span><span class="na">getRow</span><span class="o">()</span> <span class="o">*</span> <span class="mi">3</span> <span class="o">+</span> <span class="n">cell</span><span class="o">.</span><span class="na">getColumn</span><span class="o">());</span>
    <span class="o">}</span>
    <span class="k">try</span> <span class="o">{</span>
	<span class="n">MessageDigest</span> <span class="n">md</span> <span class="o">=</span> <span class="n">MessageDigest</span><span class="o">.</span><span class="na">getInstance</span><span class="o">(</span><span class="s">"SHA-1"</span><span class="o">);</span>
	<span class="kt">byte</span><span class="o">[]</span> <span class="n">hash</span> <span class="o">=</span> <span class="n">md</span><span class="o">.</span><span class="na">digest</span><span class="o">(</span><span class="n">res</span><span class="o">);</span>
	<span class="k">return</span> <span class="n">hash</span><span class="o">;</span>
    <span class="o">}</span> <span class="k">catch</span> <span class="o">(</span><span class="n">NoSuchAlgorithmException</span> <span class="n">nsa</span><span class="o">)</span> <span class="o">{</span>
	<span class="k">return</span> <span class="n">res</span><span class="o">;</span>
    <span class="o">}</span>
<span class="o">}</span>
</pre></div>

<ol class="org-ol">
<li>fileName为 <code>/data/system/gesture.key</code>
</li>
</ol>
</div>
</div>
