output/posts/android_lockscreen_crack/index.html

<div id="outline-container-org2d62318" class="outline-3">
<h3 id="org2d62318">验证</h3>
<div class="outline-text-3" id="text-org2d62318">
<p>
使用以下代码来算一个7的手势的hash值
</p>
<div class="highlight"><pre><span></span><span class="kn">import</span> <span class="nn">java.security.MessageDigest</span>
<span class="kn">import</span> <span class="nn">java.security.NoSuchAlgorithmException</span>
<span class="kn">import</span> <span class="nn">java.util.*</span>


<span class="n">fun</span> <span class="nf">main</span><span class="o">(</span><span class="n">args</span><span class="o">:</span> <span class="n">Array</span><span class="o">&lt;</span><span class="n">String</span><span class="o">&gt;)</span> <span class="o">{</span>
    <span class="n">println</span><span class="o">(</span><span class="s">"hello world!"</span><span class="o">)</span>
    <span class="n">val</span> <span class="n">gesture</span> <span class="o">=</span> <span class="n">LinkedList</span><span class="o">&lt;</span><span class="n">Cell</span><span class="o">&gt;()</span>
    <span class="n">gesture</span><span class="o">.</span><span class="na">add</span><span class="o">(</span><span class="n">Cell</span><span class="o">(</span><span class="mi">0</span><span class="o">,</span><span class="mi">0</span><span class="o">))</span>
    <span class="n">gesture</span><span class="o">.</span><span class="na">add</span><span class="o">(</span><span class="n">Cell</span><span class="o">(</span><span class="mi">0</span><span class="o">,</span><span class="mi">1</span><span class="o">))</span>
    <span class="n">gesture</span><span class="o">.</span><span class="na">add</span><span class="o">(</span><span class="n">Cell</span><span class="o">(</span><span class="mi">1</span><span class="o">,</span><span class="mi">1</span><span class="o">))</span>
    <span class="n">gesture</span><span class="o">.</span><span class="na">add</span><span class="o">(</span><span class="n">Cell</span><span class="o">(</span><span class="mi">2</span><span class="o">,</span><span class="mi">1</span><span class="o">))</span>

    <span class="n">val</span> <span class="n">hash</span> <span class="o">=</span> <span class="n">patternToHash</span><span class="o">(</span><span class="n">gesture</span><span class="o">)</span>
    <span class="n">printByte</span><span class="o">(</span><span class="n">hash</span><span class="o">)</span>
<span class="o">}</span>

<span class="n">data</span> <span class="kd">class</span> <span class="nf">Cell</span><span class="o">(</span><span class="n">val</span> <span class="n">row</span><span class="o">:</span> <span class="n">Int</span><span class="o">,</span> <span class="n">val</span> <span class="n">col</span><span class="o">:</span> <span class="n">Int</span><span class="o">)</span>

<span class="n">fun</span> <span class="nf">patternToHash</span><span class="o">(</span><span class="n">pattern</span><span class="o">:</span> <span class="n">List</span><span class="o">&lt;</span><span class="n">Cell</span><span class="o">&gt;):</span> <span class="n">ByteArray</span><span class="o">{</span>
    <span class="n">val</span> <span class="n">patternSize</span><span class="o">:</span> <span class="n">Int</span> <span class="o">=</span> <span class="n">pattern</span><span class="o">.</span><span class="na">size</span>
    <span class="n">val</span> <span class="n">res</span> <span class="o">=</span> <span class="n">ByteArray</span><span class="o">(</span><span class="n">patternSize</span><span class="o">)</span>

    <span class="k">for</span> <span class="o">(</span><span class="n">i</span> <span class="n">in</span> <span class="mi">1</span> <span class="n">until</span> <span class="n">patternSize</span><span class="o">)</span> <span class="o">{</span>
	<span class="n">val</span> <span class="n">cell</span> <span class="o">=</span> <span class="n">pattern</span><span class="o">.</span><span class="na">get</span><span class="o">(</span><span class="n">i</span><span class="o">)</span>
	<span class="n">res</span><span class="o">[</span><span class="n">i</span><span class="o">]</span> <span class="o">=</span> <span class="o">(</span><span class="n">cell</span><span class="o">.</span><span class="na">row</span> <span class="o">*</span> <span class="mi">3</span> <span class="o">+</span> <span class="n">cell</span><span class="o">.</span><span class="na">col</span><span class="o">).</span><span class="na">toByte</span><span class="o">()</span>
    <span class="o">}</span>

    <span class="k">return</span> <span class="k">try</span> <span class="o">{</span>
	<span class="n">val</span> <span class="n">md</span> <span class="o">=</span> <span class="n">MessageDigest</span><span class="o">.</span><span class="na">getInstance</span><span class="o">(</span><span class="s">"SHA-1"</span><span class="o">)</span>
	<span class="n">md</span><span class="o">.</span><span class="na">digest</span><span class="o">(</span><span class="n">res</span><span class="o">)</span>
    <span class="o">}</span> <span class="k">catch</span> <span class="o">(</span><span class="n">nsa</span><span class="o">:</span> <span class="n">NoSuchAlgorithmException</span><span class="o">)</span> <span class="o">{</span>
	<span class="n">res</span>
    <span class="o">}</span>
<span class="o">}</span>

<span class="n">fun</span> <span class="nf">printByte</span><span class="o">(</span><span class="n">byteArray</span><span class="o">:</span> <span class="n">ByteArray</span><span class="o">)</span> <span class="o">{</span>
    <span class="n">byteArray</span>
	    <span class="o">.</span><span class="na">map</span> <span class="o">{</span> <span class="n">String</span><span class="o">.</span><span class="na">format</span><span class="o">(</span><span class="s">"%02X"</span><span class="o">,</span> <span class="n">it</span><span class="o">)</span> <span class="o">}</span>
	    <span class="o">.</span><span class="na">forEach</span> <span class="o">{</span> <span class="n">print</span><span class="o">(</span><span class="n">it</span><span class="o">)</span> <span class="o">}</span>
<span class="o">}</span>
</pre></div>

<ol class="org-ol">
<li>设置锁屏密码为7</li>
<li>取出 /data/system/gesture.key 文件，查看文件内容，会发现和我们算出来的一样。</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org33673fc" class="outline-2">
<h2 id="org33673fc">密码</h2>
<div class="outline-text-2" id="text-org33673fc">
</div>
<div id="outline-container-org993da6d" class="outline-3">
<h3 id="org993da6d">步骤</h3>
<div class="outline-text-3" id="text-org993da6d">
<ol class="org-ol">
<li>和之前一样，不过这次调用的是 <code>LockSettingService</code> 的 <code>public void setLockPassword(String password, int userId)</code> 方法</li>
<li>文件为 /data/system/password.key</li>
<li>password转为hash的方法</li>
</ol>
<div class="highlight"><pre><span></span><span class="kd">public</span> <span class="kt">byte</span><span class="o">[]</span> <span class="nf">passwordToHash</span><span class="o">(</span><span class="n">String</span> <span class="n">password</span><span class="o">)</span> <span class="o">{</span>
    <span class="k">if</span> <span class="o">(</span><span class="n">password</span> <span class="o">==</span> <span class="kc">null</span><span class="o">)</span> <span class="o">{</span>
	<span class="k">return</span> <span class="kc">null</span><span class="o">;</span>
    <span class="o">}</span>
    <span class="n">String</span> <span class="n">algo</span> <span class="o">=</span> <span class="kc">null</span><span class="o">;</span>
    <span class="kt">byte</span><span class="o">[]</span> <span class="n">hashed</span> <span class="o">=</span> <span class="kc">null</span><span class="o">;</span>
    <span class="k">try</span> <span class="o">{</span>
	<span class="kt">byte</span><span class="o">[]</span> <span class="n">saltedPassword</span> <span class="o">=</span> <span class="o">(</span><span class="n">password</span> <span class="o">+</span> <span class="n">getSalt</span><span class="o">()).</span><span class="na">getBytes</span><span class="o">();</span>
	<span class="kt">byte</span><span class="o">[]</span> <span class="n">sha1</span> <span class="o">=</span> <span class="n">MessageDigest</span><span class="o">.</span><span class="na">getInstance</span><span class="o">(</span><span class="n">algo</span> <span class="o">=</span> <span class="s">"SHA-1"</span><span class="o">).</span><span class="na">digest</span><span class="o">(</span><span class="n">saltedPassword</span><span class="o">);</span>
	<span class="kt">byte</span><span class="o">[]</span> <span class="n">md5</span> <span class="o">=</span> <span class="n">MessageDigest</span><span class="o">.</span><span class="na">getInstance</span><span class="o">(</span><span class="n">algo</span> <span class="o">=</span> <span class="s">"MD5"</span><span class="o">).</span><span class="na">digest</span><span class="o">(</span><span class="n">saltedPassword</span><span class="o">);</span>
	<span class="n">hashed</span> <span class="o">=</span> <span class="o">(</span><span class="n">toHex</span><span class="o">(</span><span class="n">sha1</span><span class="o">)</span> <span class="o">+</span> <span class="n">toHex</span><span class="o">(</span><span class="n">md5</span><span class="o">)).</span><span class="na">getBytes</span><span class="o">();</span>
    <span class="o">}</span> <span class="k">catch</span> <span class="o">(</span><span class="n">NoSuchAlgorithmException</span> <span class="n">e</span><span class="o">)</span> <span class="o">{</span>
	<span class="n">Log</span><span class="o">.</span><span class="na">w</span><span class="o">(</span><span class="n">TAG</span><span class="o">,</span> <span class="s">"Failed to encode string because of missing algorithm: "</span> <span class="o">+</span> <span class="n">algo</span><span class="o">);</span>
    <span class="o">}</span>
    <span class="k">return</span> <span class="n">hashed</span><span class="o">;</span>
<span class="o">}</span>

<span class="kd">private</span> <span class="n">String</span> <span class="nf">getSalt</span><span class="o">()</span> <span class="o">{</span>
    <span class="kt">long</span> <span class="n">salt</span> <span class="o">=</span> <span class="n">getLong</span><span class="o">(</span><span class="n">LOCK_PASSWORD_SALT_KEY</span><span class="o">,</span> <span class="mi">0</span><span class="o">);</span>
    <span class="k">if</span> <span class="o">(</span><span class="n">salt</span> <span class="o">==</span> <span class="mi">0</span><span class="o">)</span> <span class="o">{</span>
	<span class="k">try</span> <span class="o">{</span>
	    <span class="n">salt</span> <span class="o">=</span> <span class="n">SecureRandom</span><span class="o">.</span><span class="na">getInstance</span><span class="o">(</span><span class="s">"SHA1PRNG"</span><span class="o">).</span><span class="na">nextLong</span><span class="o">();</span>
	    <span class="n">setLong</span><span class="o">(</span><span class="n">LOCK_PASSWORD_SALT_KEY</span><span class="o">,</span> <span class="n">salt</span><span class="o">);</span>
	    <span class="n">Log</span><span class="o">.</span><span class="na">v</span><span class="o">(</span><span class="n">TAG</span><span class="o">,</span> <span class="s">"Initialized lock password salt"</span><span class="o">);</span>
	<span class="o">}</span> <span class="k">catch</span> <span class="o">(</span><span class="n">NoSuchAlgorithmException</span> <span class="n">e</span><span class="o">)</span> <span class="o">{</span>
	    <span class="c1">// Throw an exception rather than storing a password we'll never be able to recover</span>
	    <span class="k">throw</span> <span class="k">new</span> <span class="n">IllegalStateException</span><span class="o">(</span><span class="s">"Couldn't get SecureRandom number"</span><span class="o">,</span> <span class="n">e</span><span class="o">);</span>
	<span class="o">}</span>
    <span class="o">}</span>
    <span class="k">return</span> <span class="n">Long</span><span class="o">.</span><span class="na">toHexString</span><span class="o">(</span><span class="n">salt</span><span class="o">);</span>
<span class="o">}</span>
</pre></div>
<ol class="org-ol">
<li>这里的salt为一个随机数，存储在数据库 /data/system/locksettings.db 中。注意这里可能把db文件拿出来之后没有数据，需要把连带的wal, shm两个文件都拿出来才看得到数据</li>
</ol>
</div>
</div>
